CREATE SCHEMA ticket4;
SET search_path = 'ticket4';

CREATE TABLE category(
	id SERIAL PRIMARY KEY,
	desk VARCHAR(50)
);

CREATE TABLE med(
	id SERIAL PRIMARY KEY,
	name VARCHAR(50) NOT NULL,
	count INTEGER NOT NULL,
	price INTEGER NOT NULL,
	category INTEGER REFERENCES category(id) NOT NULL
);

-- Вставка категорий
INSERT INTO category (desk) VALUES
('Антибиотики'),
('Витамины'),
('Обезболивающие'),
('Противовирусные');

-- Вставка лекарств
INSERT INTO med (name, count, price, category) VALUES
-- Категория 1: Антибиотики
('Амоксициллин', 50, 200, 1),
('Цефтриаксон', 30, 300, 1),
('Азитромицин', 40, 250, 1),
('Доксициклин', 25, 150, 1),
('Левофлоксацин', 20, 350, 1),

-- Категория 2: Витамины
('Витамин С', 100, 50, 2),
('Витамин D', 80, 60, 2),
('Комплекс B', 70, 120, 2),
('Магний B6', 60, 140, 2),
('Кальций D3', 90, 100, 2),

-- Категория 3: Обезболивающие
('Ибупрофен', 40, 80, 3),
('Парацетамол', 50, 60, 3),
('Диклофенак', 30, 90, 3),
('Нимесулид', 25, 110, 3),
('Кеторолак', 20, 130, 3),

-- Категория 4: Противовирусные
('Арбидол', 35, 300, 4),
('Ингавирин', 20, 400, 4),
('Ацикловир', 50, 150, 4),
('Кагоцел', 25, 350, 4),
('Тамифлю', 15, 500, 4);




